# BoundaryAreaRestraintY Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryAreaRestraintY Property
ParameterTypeId Class See Also
---
"Y Spring Modulus"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryAreaRestraintY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryAreaRestraintY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryAreaRestraintY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace